In [1]:
import pandas as pd

Creating a data frame and saving it as a CSV file

In [2]:
import pandas as pd
df = pd.DataFrame()
df['Name']=['Subhash','Simar','Nole','Rune','Gurjot','Anil','Leclerc','Duplantis','Russell','Axelsen']
df['Age']=['19','19','37','21','20','20','26','24','26','30']
df['Gender']=['Male','Male','Male','Male','Male','Male','Male','Male','Male','Male']
df['Address']=['Andhra Pradesh','Andhra Pradesh','Serbia','Denmark','Punjab','Punjab','Monaco','Sweden','England','Denmark']
df.to_csv('exampleset.csv')
print(df)

        Name Age Gender         Address
0    Subhash  19   Male  Andhra Pradesh
1      Simar  19   Male  Andhra Pradesh
2       Nole  37   Male          Serbia
3       Rune  21   Male         Denmark
4     Gurjot  20   Male          Punjab
5       Anil  20   Male          Punjab
6    Leclerc  26   Male          Monaco
7  Duplantis  24   Male          Sweden
8    Russell  26   Male         England
9    Axelsen  30   Male         Denmark

Loading and navigating a data frame

In [3]:
import pandas as pd
df = pd.read_csv('exampleset.csv')
df.iloc[0:3]

   Unnamed: 0     Name  Age Gender         Address
0           0  Subhash   19   Male  Andhra Pradesh
1           1    Simar   19   Male  Andhra Pradesh
2           2     Nole   37   Male          Serbia

Selecting rows on conditions

In [27]:
import pandas as pd
df = pd.read_csv('exampleset.csv')
df[df['Gender']=='Male']

   Unnamed: 0       Name  Age Gender         Address
0           0    Subhash   19   Male  Andhra Pradesh
1           1      Simar   19   Male  Andhra Pradesh
2           2       Nole   37   Male          Serbia
3           3       Rune   21   Male         Denmark
4           4     Gurjot   20   Male          Punjab
5           5       Anil   20   Male          Punjab
6           6    Leclerc   26   Male          Monaco
7           7  Duplantis   24   Male          Sweden
8           8    Russell   26   Male         England
9           9    Axelsen   30   Male         Denmark

Replacing values

In [28]:
import pandas as pd
df = pd.read_csv('exampleset.csv')
df['Address'].replace("Sweden","Copenhagen")

0    Andhra Pradesh
1    Andhra Pradesh
2            Serbia
3           Denmark
4            Punjab
5            Punjab
6            Monaco
7        Copenhagen
8           England
9           Denmark
Name: Address, dtype: object

Renaming Columns

In [29]:
import pandas as pd
df = pd.read_csv('exampleset.csv')
df.rename(columns={'Gender':"Sex"})

   Unnamed: 0       Name  Age   Sex         Address
0           0    Subhash   19  Male  Andhra Pradesh
1           1      Simar   19  Male  Andhra Pradesh
2           2       Nole   37  Male          Serbia
3           3       Rune   21  Male         Denmark
4           4     Gurjot   20  Male          Punjab
5           5       Anil   20  Male          Punjab
6           6    Leclerc   26  Male          Monaco
7           7  Duplantis   24  Male          Sweden
8           8    Russell   26  Male         England
9           9    Axelsen   30  Male         Denmark

Mathematical Functions

In [7]:
import pandas as pd
df = pd.read_csv('exampleset.csv')
print(df['Age'].max()), print(df['Age'].min())
print(df['Age'].sum()), print(df['Age'].mean())
print(df['Age'].count())

37
19
242
24.2
10

Unique Values

In [12]:
import pandas as pd
df = pd.read_csv('exampleset.csv')
print(df['Address'].unique())

['Andhra Pradesh' 'Serbia' 'Denmark' 'Punjab' 'Monaco' 'Sweden' 'England']

Deleting Columns

In [34]:
import pandas as pd
df = pd.read_csv('exampleset.csv')
df = df[df['Age']>=30]
df.drop(['Age'],axis=1)

   Unnamed: 0     Name Gender  Address
2           2     Nole   Male   Serbia
9           9  Axelsen   Male  Denmark